[
  {
    "url": "https://www.restaurants.co.za/johannesburg/all/american",
    "content": {
      "title": "American Restaurants in Johannesburg",
      "paragraphs": [
        " Kempton (Emperors Palace), Gauteng American ",
        "Welcome to the destination to experience the vibrant flavours of Africa and be part of the celebration of its beauty.\r\n\t​\r\n\tA luxurious setting where a mixed fusion of African ambiance blends its...",
        " Bedfordview, Gauteng American ",
        "Our food has been developed around the urban culture and vibrant city of Brooklyn, which in itself is a trend.\r\n\r\n\tWe offer great burgers, inspired from the borough’s street culture, with our...",
        " Sterkfontein, Gauteng American ",
        "NOT JUST A MEDIEVAL KINGDOM ANYMORE....\r\n\r\n\t \r\n\r\n\tMEDIEVAL FEASTS\r\n\r\n\tGreensleeves and its medieval feasting has been a well-known Sterkfontein venue for visitors from all over the world. Come...",
        " Fourways Central, Gauteng American ",
        "The ROCK, Design Quarter is a beautifully appointed and contemporary styled casual dining restaurant in the piazza. The ROCK has been created not only for visual effect but for practical use too; t...",
        " Kyalami, Gauteng American ",
        "The ROCK, is a beautifully appointed and contemporary styled casual dining restaurant in Kyalami. The ROCK has been created not only for visual effect but for practical use too; the kitchen feature...",
        " Rivonia, Gauteng American ",
        "Byblos Hubbly Lounge is a Shisha Bar in Rivonia, Sandton, located on Rivonia Boulevard.  Come and enjoy a cosy atmosphere and kick back on our couches with your friends. It's beautiful, cl...",
        " Sandton Central, Gauteng American ",
        "Maximillien Restaurant is situated in the heart of Sandton’s commercial and retail district.\r\n\r\n\tThe Restaurant serves a sophisticated menu in a stylish atmosphere with soft lighting and...",
        "\r\n\tDive into a hearty plate of Eisbein served with golden baby potatoes and a colourful medley of mixed vegetables, and a complime...     Read More",
        "\r\n\tTIME: 13H00 – 18H00\r\n\r\n\tVENUE: The Troyeville Rooftop\r\n\r\n\tCOST: R150 per person (Kids under 14 FREE!)\r\n\r\n\tTICKET SALES: w...     Read More",
        "\r\n\tWhether a birthday party, anniversary celebration, baby shower or just friends and family coming together to celebrate life, we...     Read More",
        "Copyright 2022  |  \r\n                            Terms and Conditions\r\n                              |  \r\n                            Privacy Policy\r\n                              |  \r\n                            Advertise\n"
      ]
    }
  },
  {
    "url": "https://www.restaurants.co.za/johannesburg/all/american",
    "content": {
      "title": "American Restaurants in Johannesburg",
      "paragraphs": [
        " Kempton (Emperors Palace), Gauteng American ",
        "Welcome to the destination to experience the vibrant flavours of Africa and be part of the celebration of its beauty.\r\n\t​\r\n\tA luxurious setting where a mixed fusion of African ambiance blends its...",
        " Bedfordview, Gauteng American ",
        "Our food has been developed around the urban culture and vibrant city of Brooklyn, which in itself is a trend.\r\n\r\n\tWe offer great burgers, inspired from the borough’s street culture, with our...",
        " Sterkfontein, Gauteng American ",
        "NOT JUST A MEDIEVAL KINGDOM ANYMORE....\r\n\r\n\t \r\n\r\n\tMEDIEVAL FEASTS\r\n\r\n\tGreensleeves and its medieval feasting has been a well-known Sterkfontein venue for visitors from all over the world. Come...",
        " Fourways Central, Gauteng American ",
        "The ROCK, Design Quarter is a beautifully appointed and contemporary styled casual dining restaurant in the piazza. The ROCK has been created not only for visual effect but for practical use too; t...",
        " Kyalami, Gauteng American ",
        "The ROCK, is a beautifully appointed and contemporary styled casual dining restaurant in Kyalami. The ROCK has been created not only for visual effect but for practical use too; the kitchen feature...",
        " Rivonia, Gauteng American ",
        "Byblos Hubbly Lounge is a Shisha Bar in Rivonia, Sandton, located on Rivonia Boulevard.  Come and enjoy a cosy atmosphere and kick back on our couches with your friends. It's beautiful, cl...",
        " Sandton Central, Gauteng American ",
        "Maximillien Restaurant is situated in the heart of Sandton’s commercial and retail district.\r\n\r\n\tThe Restaurant serves a sophisticated menu in a stylish atmosphere with soft lighting and...",
        "\r\n\tALL plates pink R55!\r\n\r\n\t\r\n\t\tSit down only\r\n\t\r\n\t\tNo take aways\r\n\r\n\r\n\tR1 per Pink Plate will be donated to the SPCA!\r\n     Read More",
        "\r\n\tOrder our delightful Lamb Shank & receive a complimentary glass of Old Brown Sherry - R340!\r\n     Read More",
        "\r\n\tHave you indulged in our Seasonal Lunch?\r\n\r\n\tDine on any 2 delicious courses @ R185pp.\r\n\r\n\tAvailable Monday – Saturday, 1...     Read More",
        "Copyright 2022  |  \r\n                            Terms and Conditions\r\n                              |  \r\n                            Privacy Policy\r\n                              |  \r\n                            Advertise\n"
      ]
    }
  },
  {
    "url": "https://wanderlog.com/list/geoCategory/2150/best-american-restaurants-in-johannesburg",
    "content": {
      "title": "The 43 best American restaurants in Johannesburg",
      "paragraphs": [
        "Navigate forward to interact with the calendar and select a date. Press the question mark key to get the keyboard shortcuts for changing dates.",
        "Navigate backward to interact with the calendar and select a date. Press the question mark key to get the keyboard shortcuts for changing dates.",
        "Navigate forward to interact with the calendar and select a date. Press the question mark key to get the keyboard shortcuts for changing dates.",
        "Navigate backward to interact with the calendar and select a date. Press the question mark key to get the keyboard shortcuts for changing dates.",
        "Navigate forward to interact with the calendar and select a date. Press the question mark key to get the keyboard shortcuts for changing dates.",
        "Navigate backward to interact with the calendar and select a date. Press the question mark key to get the keyboard shortcuts for changing dates.",
        "It depends on when you visit! We've compiled data from NASA on what the weather is like in Johannesburg for each month of the year: see the links below for more information.",
        "Get inspired for your trip to Johannesburg with our curated itineraries that are jam-packed with popular attractions everyday! Check them out here:"
      ]
    }
  },
  {
    "url": "https://www.dining-out.co.za/restaurants/American-South-Africa/10-5",
    "content": {
      "title": "\r\n\tSouth Africa American Restaurants\r\n",
      "paragraphs": []
    }
  },
  {
    "url": "https://www.dining-out.co.za/restaurants/American-Gauteng/240-5",
    "content": {
      "title": "\r\n\tGauteng American Restaurants\r\n",
      "paragraphs": []
    }
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_restaurant_chains_in_the_United_States",
    "content": {
      "title": "List of restaurant chains in the United States - Wikipedia",
      "paragraphs": [
        "\nThe following is a list of notable restaurant chains in the United States.\n",
        "Hardee's\n",
        "Rocky Mount, North Carolina\n",
        "1960\n",
        "1,062 (Carl's Jr.)\n1,712 (Hardee's)\n",
        "Rally's\n",
        "Louisville, Kentucky\n",
        "1986\n",
        "580 (Checkers)\n315 (Rally's)\n",
        "Casual dining restaurants below are split by the type of cuisine they serve.\n",
        "BJ's Restaurant & Brewhouse, BJ's Grill, and BJ's Pizza & Grill.\n",
        "with most branded as Houston's or Hillstone\n",
        "\n",
        "Bonanza Steakhouses\n",
        "Westport, Connecticut\n",
        "1965\n"
      ]
    }
  },
  {
    "url": "https://greatamericanrestaurants.com/",
    "content": {
      "title": "Great American Restaurants",
      "paragraphs": []
    }
  },
  {
    "url": "https://stacker.com/food-drink/50-most-popular-chain-restaurants-america",
    "content": {
      "title": "50 Most Popular Chain Restaurants in America | Stacker",
      "paragraphs": [
        "With the advent of Big Data, it's now easier than ever to quantify what people like around the globe. When it comes to food, Americans have particularly specific opinions. American dining brands have a long and storied history, and whether it's fast food, fast-casual, high-end, or super cheap, U.S. restaurants offer something for almost everyone.",
        "What's clear about U.S. dining habits is that people love options. Restaurants across America are chock-full of variety, mixing foods from various regions and cultures into steaming melting pots of deliciousness.",
        "Stacker analyzed 2022 Q1 data from YouGov to rank the 50 most popular chain restaurants in the U.S. The rating agency surveys people on a daily basis across a variety of areas—such as culture, politics, and business—to determine what people like and dislike. YouGov's overall positive opinion scores represent the percentage of people who had a positive response out of those surveyed, and they are also broken down by generation—baby boomers, Gen Xers, and millennials.",
        "Read on for a look at America's vast and divergent variety of chain restaurants.",
        "- Positive opinion score: 48%\n--- Popularity among boomers: 48%\n--- Popularity among Gen X: 40%\n--- Popularity among millennials: 52%",
        "A subsidiary of the Panda Restaurant Group, Panda Express started as a formal, sit-down restaurant, called Panda Inn, in Pasadena, California, in 1973. The restaurant's founders, father-and-son team Ming-Tsai Cherng and Andrew Cherng, crafted a menu of Mandarin and Sichuan dishes that filled a gap in the area's market. Their success allowed them to open a number of similar restaurants in the surrounding community.",
        "In 1983, a year after Ming-Tsai's wife, Peggy Cherng, joined the company, the restaurant group opened a fast-food version of their restaurant in the Glendale Galleria, which they dubbed Panda Express. There are now more than 2,200 Panda Express restaurants.",
        "- Positive opinion score: 48%\n--- Popularity among boomers: 47%\n--- Popularity among Gen X: 50%\n--- Popularity among millennials: 46%",
        "The original Jersey Mike's Subs opened in a popular Jersey Shore town, Point Pleasant, in 1956. In 1971, 17-year-old high school student and Jersey Mike's employee Peter Cancro bought the stand-alone restaurant from its aging founder, and after opening a handful of outlet stores in the area, began franchising in 1987. Today, there are over 2,000 Jersey Mike's restaurants in the United States, as well as a couple of stores in Australia and Canada.",
        "- Positive opinion score: 49%\n--- Popularity among boomers: 41%\n--- Popularity among Gen X: 51%\n--- Popularity among millennials: 55%",
        "Auntie Anne's was started in 1988 at a Pennsylvania farmers market. Founder Anne Beiler began selling her soft, freshly baked pretzels in an effort to fund her dream of providing free family counseling services for her community. To this day, the company makes giving back a priority, partnering with Alex's Lemonade Stand Foundation to find a cure for childhood cancer.",
        "- Positive opinion score: 49%\n--- Popularity among boomers: 44%\n--- Popularity among Gen X: 51%\n--- Popularity among millennials: 55%",
        "Not many chain restaurants can claim they were started by acclaimed chefs, but Quiznos can. Jimmy Lambatos, who had previously worked at Colorado Mine Company (a steakhouse in Glendale, Colorado), opened his own sandwich shop in Denver in 1981. The restaurateur claimed the unique heated subs he sold at Quiznos were inspired by the sandwiches he ate during his childhood living on Long Island.",
        "In 1987, Lambatos sold his chain to a franchisee named Rick Schaden, who grew the chain to 5,000 restaurants in its heyday back in 2006. As of 2021, there were 255 locations in the U.S.",
        "- Positive opinion score: 49%\n--- Popularity among boomers: 54%\n--- Popularity among Gen X: 47%\n--- Popularity among millennials: 48%",
        "Golden Corral's stated mission is to \"offer guests real, wholesome foods in a family-friendly atmosphere and at a great value.\" The restaurant, which opened in 1973, is a buffet-style eatery offering up classic American dishes, from salads and pizzas to fried chicken and ribs. Golden Corral has more than 400 locations around the United States.",
        "- Positive opinion score: 51%\n--- Popularity among boomers: 50%\n--- Popularity among Gen X: 58%\n--- Popularity among millennials: 50%",
        "What started as a small-themed restaurant in London in 1971 has since turned into a megafranchise with 185 cafés, more than two dozen hotels, and multiple casinos all over the world. Two Americans, Isaac Tigrett and Peter Morton, just wanted a good burger in the U.K.; when they couldn't find one, they started their own company. The cafés are renowned for their extensive collections of rock 'n' roll memorabilia that hang on every free space in the restaurants, as well as regularly scheduled live concerts at many of the venues. The food generally consists of burgers, fries, sandwiches, steaks, and other American favorites.",
        "- Positive opinion score: 51%\n--- Popularity among boomers: 47%\n--- Popularity among Gen X: 51%\n--- Popularity among millennials: 56%",
        "When Jim Disbrow and Scott Lowery were living in Ohio in 1982, they had a hankering for Buffalo-style wings—only they realized there was nowhere to satiate their craving. As a result, the two men opened their own restaurant, and Buffalo Wild Wings has since turned into an international craze with more than 1,000 locations around the globe. The restaurant is known for its Buffalo-style wings, but it's also a sports bar that serves sandwiches, wraps, burgers, and lots of cold brews.",
        "- Positive opinion score: 52%\n--- Popularity among boomers: 46%\n--- Popularity among Gen X: 56%\n--- Popularity among millennials: 52%",
        "Based in Denver, Chipotle serves up real food with no artificial colors, flavors, or preservatives. The burrito and bowl spot has more than 2,400 locations throughout the country. The owners chose not to franchise the business, believing instead that holding ownership allows them to set the tone for their employees and better control the quality of their ingredients. McDonald's was an early and major investor but has since divested entirely.",
        "- Positive opinion score: 52%\n--- Popularity among boomers: 56%\n--- Popularity among Gen X: 47%\n--- Popularity among millennials: 52%",
        "Polish Jewish immigrant Nathan Handwerker opened up the first Nathan's Famous hot dog stand on Coney Island in 1916. Fellow immigrants flocked to his Brooklyn shop, eager to get their hands on his frankfurters, which were seasoned with his wife Ida's secret blend and sold for only a nickel.",
        "In 1959, Nathan's son, Murray Handwerker, began opening other branches of the restaurant in New York City, and by 2001, there were locations in every state in America as well as in several countries around the world. Today, the chain is the official hotdog sponsor of the MLB, runs its own annual hot dog eating contest on the Fourth of July, and also sells a line of products in grocery stores across the country.",
        "- Positive opinion score: 52%\n--- Popularity among boomers: 47%\n--- Popularity among Gen X: 58%\n--- Popularity among millennials: 53%",
        "Little Caesars was started by a husband-and-wife team in Michigan in 1959. Today, it is one of the biggest pizza chains in the United States. The company truly took off in 1979 when it coined its famous phrase \"Pizza! Pizza!\" and started selling two pizzas for the price of one. Today, the chain has thousands of locations around the world and is just as well-known for its sit-down restaurants as it is for delivery and carry-out.",
        "- Positive opinion score: 52%\n--- Popularity among boomers: 54%\n--- Popularity among Gen X: 51%\n--- Popularity among millennials: 55%",
        "TGI Friday's began as a cocktail bar that catered to single folks on New York City's Upper East Side. Alan Stillman opened the first location in 1965, and it was an instant success. Two years later, Stillman began franchising, and it was these early suburban locations, which focused on food and a family atmosphere rather than being a place for attractive young 20-somethings to be seen, that transformed it into the diner-style restaurant we know it as today. As of 2022, there are 900 TGI Friday's locations in 60 countries around the world.",
        "- Positive opinion score: 53%\n--- Popularity among boomers: 50%\n--- Popularity among Gen X: 50%\n--- Popularity among millennials: 56%",
        "Although its founder John Schnatter was ousted as CEO over his controversial comments on the NFL in 2017, the franchise is still going strong with more than 3,000 locations around the United States. Papa John's was founded by Schnatter in 1984 and is known for its signature dipping sauce that separates it from other pizza delivery chains like Domino's and Pizza Hut.",
        "- Positive opinion score: 53%\n--- Popularity among boomers: 54%\n--- Popularity among Gen X: 55%\n--- Popularity among millennials: 52%",
        "After falling in love with chili cook-offs, Chili's Grill & Bar founder Larry Lavine decided to open his own restaurant in Texas in 1975 to share that love with the world. Chili's concept was always a family-friendly, casual dining eatery at reasonable prices, and that mantra remains to this day. The sit-down restaurant is known for its burgers, fajitas, and all kinds of American fare at more than 1,000 locations across the globe.",
        "- Positive opinion score: 53%\n--- Popularity among boomers: 57%\n--- Popularity among Gen X: 54%\n--- Popularity among millennials: 52%",
        "Originally called Boston Chicken when it was founded in 1985 in Newton, Massachusetts, Boston Market is an inexpensive rotisserie chicken restaurant with nearly 350 locations across the United States. The company changed its name in 1995 after expanding its menu to include ribs, meatloaf, turkey, and a bevy of savory sides.",
        "- Positive opinion score: 54%\n--- Popularity among boomers: 58%\n--- Popularity among Gen X: 53%\n--- Popularity among millennials: 57%",
        "White Castle began in Whiticha, Kansas, in 1921 and claims it's \"the first fast-food hamburger chain in the world.\" The brand's focus on cleanliness, quality, and an affordable price point has been credited with convincing Americans that hamburgers (which had previously been viewed as an unsanitary and unsafe option) were good, healthy, and safe to eat. The company, which has never franchised and wholly owns every location, currently operates about 349 locations in just 14 states, primarily in the Midwest and on the East Coast.",
        "- Positive opinion score: 54%\n--- Popularity among boomers: 57%\n--- Popularity among Gen X: 56%\n--- Popularity among millennials: 49%",
        "First opened in 1981 in Atlanta as LongHorn Steaks Restaurant & Saloon, LongHorn Steakhouse is a casual dining steak joint with more than 450 locations around the United States. The chain is owned and operated by Darden Restaurants, whose portfolio also includes the Olive Garden, Yard House, and The Capital Grille. Obviously known for its steaks, LongHorn Steakhouse also serves burgers, sandwiches, ribs, chicken, and fish.",
        "- Positive opinion score: 54%\n--- Popularity among boomers: 53%\n--- Popularity among Gen X: 54%\n--- Popularity among millennials: 56%",
        "The name Five Guys is derived from founders Jerry Murrell and his four sons Ben, Jim, Chad, and Matt. The family-owned business got its start in the Washington D.C. area in 1986 and has since expanded to more than 1,500 locations in the United States and around the world. Five Guys is a fast-casual chain known for its burgers, hot dogs, and fries, but true fans of the establishment know about its secret menu. It includes favorites like the patty melt, double-grilled cheeseburger, or the Presidential, so-named for former United States President Barack Obama's special order: a cheeseburger with jalapeño peppers, lettuce, tomato, and mustard.",
        "- Positive opinion score: 55%\n--- Popularity among boomers: 64%\n--- Popularity among Gen X: 52%\n--- Popularity among millennials: 44%",
        "This fast-food chain was first popularized back in 1919 as a root beer stand in California. With the advent of Prohibition in the 1920s, A&W played on the name \"root beer\" to attract alcohol drinkers to its establishment. Today, A&W is still famous for its draft-style root beer, root beer floats, and sizzling burgers. A&W's root beer was so popular that the company began selling the drink in bottles and cans. The company now has locations across the globe and is part of a conglomerate that includes Dr. Pepper, Snapple, and 7 Up.",
        "- Positive opinion score: 55%\n--- Popularity among boomers: 64%\n--- Popularity among Gen X: 62%\n--- Popularity among millennials: 45%",
        "In 1977, Debbi Fields opened the first Mrs. Fields store in Palo Alto, California, which served warm and fresh cookies to its patrons. The parent company, Famous Brands International, purchased TCBY, the country's first frozen yogurt chain, in the 1990s. Today, the company is headquartered in Broomfield, Colorado, and there are more than 250 franchise locations around the world.",
        "- Positive opinion score: 55%\n--- Popularity among boomers: 54%\n--- Popularity among Gen X: 54%\n--- Popularity among millennials: 57%",
        "Founded in Seattle in 1940, the original name of the restaurant was Sam's Red Robin. That all changed when Gerry Kingen bought the restaurant in 1969 and began rapid expansion across the country. Today, there are more than 500 Red Robin restaurants, which are considered casual dining spots with American fare like burgers, sandwiches, and fried appetizers.",
        "You may also like: Signature breakfast foods in every state",
        "- Positive opinion score: 56%\n--- Popularity among boomers: 59%\n--- Popularity among Gen X: 52%\n--- Popularity among millennials: 54%",
        "Waffle House is one of the biggest franchises in the United States, consisting of more than 2,000 locations across 25 states. The first Waffle House launched in Avondale Estates, Georgia, where partners Joe Rogers and Tom Forkner opened their restaurant on Labor Day of 1955. Every Waffle House is open 24 hours a day, 365 days a year, and serves reasonably priced waffles (of course), as well as omelets, melts, steak and eggs, burgers, and sandwiches.",
        "- Positive opinion score: 56%\n--- Popularity among boomers: 71%\n--- Popularity among Gen X: 52%\n--- Popularity among millennials: 43%",
        "Marie Callender was a real person who started selling her home-baked pies to supplement her family's income in the early 1940s. Callender, her husband Carl, and their son Don soon turned the small delivery business into a thriving bakery delivering pies to restaurants around Orange County, California. Pretty soon, the delivery business turned into a retail business with pie shops around California and beyond. Today, Marie Callender operates around 30 stores in the United States that serve a wide variety of pies. It is also a sit-down restaurant chain offering burgers, sandwiches, salads, and other American favorites, such as meatloaf and roasted turkey.",
        "- Positive opinion score: 56%\n--- Popularity among boomers: 59%\n--- Popularity among Gen X: 63%\n--- Popularity among millennials: 49%",
        "Harold Butler and Richard Jezak opened a donut stand in 1953 called Danny's Donuts, where they aimed to serve the best coffee and donuts 24 hours a day. The name was changed to Denny's Coffee Shops in 1959 and then finally Denny's in 1961. Since then, the breakfast joint—which is still open 24 hours each day—has expanded around the world with more than 1,600 restaurants. Denny's is typically known for its diner-style ambiance and breakfast items, but the restaurant also serves burgers, steaks, and other American fare throughout the day.",
        "- Positive opinion score: 56%\n--- Popularity among boomers: 56%\n--- Popularity among Gen X: 60%\n--- Popularity among millennials: 55%",
        "Cold Stone Creamery is an ice cream parlor chain where sugary treats are made to order. Cold Stone's specialty is mixing up ice cream flavors atop a 16-degree granite slab with a choice of numerous toppings. Cold Stone started in Tempe, Arizona, in 1988, and now has more than 1,000 locations. Today, the company is owned by Kahala Brands, which also has Baja Fresh, Blimpie, and Pinkberry in its portfolio.",
        "- Positive opinion score: 58%\n--- Popularity among boomers: 63%\n--- Popularity among Gen X: 61%\n--- Popularity among millennials: 48%",
        "Bill Darden started Red Lobster in Lakeland, Florida, in 1968 with a single restaurant. Today, there are more than 700 Red Lobster joints around the world. Red Lobster is a family-friendly restaurant whose mission is to bring inexpensive seafood to the masses. The menu always includes a fresh catch of the day, in addition to lobster, shrimp, steaks, and sides. Red Lobster was formerly part of the Darden Restaurants group, which also counts Yard House, LongHorn Steakhouse, and The Capital Grille in its portfolio. Now, it is owned by Thai Union.",
        "- Positive opinion score: 58%\n--- Popularity among boomers: 54%\n--- Popularity among Gen X: 58%\n--- Popularity among millennials: 61%",
        "Though Ray Kroc is credited with McDonald's meteoric rise around the world, the fast-food burger joint was actually started by Dick and Maurice McDonald in San Bernardino, California. After eating at the restaurant, Kroc was so impressed that he started franchising and bought the exclusive rights to McDonald's in 1961. Today, the fast-food chain—known for burgers, fries, and drive-thrus—is one of the most recognizable brands on the planet with over 30,000 restaurants and billions of dollars in sales.",
        "- Positive opinion score: 58%\n--- Popularity among boomers: 62%\n--- Popularity among Gen X: 59%\n--- Popularity among millennials: 56%",
        "Despite its name, Outback Steakhouse is merely an Australian-inspired steak restaurant; it was founded in Tampa, Florida, in 1988. The restaurant initially differentiated itself by providing top-quality steaks at reasonable prices, placing it in the middle between low-end meat spots and high-end steak joints. The family-friendly establishment is known for steaks, of course, but also creative delicacies like the Bloomin' Onion, Kookaburra Wings, Sydney 'Shrooms, and other Aussie-themed items.",
        "- Positive opinion score: 58%\n--- Popularity among boomers: 68%\n--- Popularity among Gen X: 55%\n--- Popularity among millennials: 50%",
        "With a Southern country ethos based on warm hospitality and home-style food, Cracker Barrel has been a roadside staple since 1969. The part restaurant, part gift shop got its start in Tennessee as a family-friendly, sit-down restaurant. There are now more than 600 Cracker Barrels around the country, and they can usually be found close to highways, as they're known to attract long-haul commuters with their food and general stores.",
        "- Positive opinion score: 59%\n--- Popularity among boomers: 57%\n--- Popularity among Gen X: 58%\n--- Popularity among millennials: 66%",
        "New Orleans has a long and savory culinary history, and that's where Popeyes Louisiana Kitchen was born and bred. Founded in 1972, Popeyes was launched by Al Copeland and reportedly takes its name from Detective Jimmy \"Popeye\" Doyle from the movie \"The French Connection.\" Today, Popeyes is known for its succulent and inexpensive fried chicken in restaurants around the world. There are currently more than 2,600 outlets and growing.",
        "- Positive opinion score: 59%\n--- Popularity among boomers: 61%\n--- Popularity among Gen X: 58%\n--- Popularity among millennials: 55%",
        "Founded by Glen Bell in San Bernardino, California, Taco Bell was originally a hot dog stand called Bell's Drive-In and Taco Tia in 1954. Bell opened his first Taco Bell in 1962 and began franchising outlets around Los Angeles and beyond. The fast-food Mexican restaurant became one of the fastest-growing brands in the world, and there are now upwards of 7,000 locations. Bell eventually sold his stake in Taco Bell to PepsiCo, which then sold to Yum! Brands, which also owns Pizza Hut and Kentucky Fried Chicken.",
        "You may also like: Every major fast-food chain, ranked by customer satisfaction",
        "- Positive opinion score: 59%\n--- Popularity among boomers: 65%\n--- Popularity among Gen X: 61%\n--- Popularity among millennials: 55%",
        "Despite its name, Texas Roadhouse is a Western-themed steak joint that's headquartered in Louisville, Kentucky, and has origins in Clarksville, Indiana. Opened by Wayne Kent Taylor in 1993, the eatery has more than 600 locations around the world including the United States, Indonesia, and Turkey. The family-friendly restaurant is known for its variety of hand-cut steaks, but it also offers chicken, sandwiches, burgers, and other American specialties.",
        "- Positive opinion score: 59%\n--- Popularity among boomers: 61%\n--- Popularity among Gen X: 58%\n--- Popularity among millennials: 57%",
        "The secrecy around Kentucky Fried Chicken's special recipe remains shrouded in mystery, but the fast-food chain is as popular as ever, boasting 24,000 outlets around the world. Col. Harland Sanders created KFC's famous fried chicken in 1940 and grew the company into the multibillion-dollar behemoth it is today. KFC is known for its buckets of fried chicken, along with sandwiches and sides that include everything from mac and cheese and corn to green beans and potatoes.",
        "- Positive opinion score: 59%\n--- Popularity among boomers: 65%\n--- Popularity among Gen X: 55%\n--- Popularity among millennials: 59%",
        "The name Arby's comes from its founders Leroy and Forrest Raffel, known as the Raffel Brothers—hence R.B.'s. The brothers were looking to start a fast-food franchise that would be different than the popular burger chains. As a result, they landed on freshly sliced roast beef sandwiches; the company's been growing ever since. Arby's slogan, \"We have the meats,\" still holds true, as the sandwich shop serves everything from roast beef and turkey to brisket and Italian subs.",
        "- Positive opinion score: 60%\n--- Popularity among boomers: 64%\n--- Popularity among Gen X: 60%\n--- Popularity among millennials: 56%",
        "The Olive Garden is a fast-casual Italian restaurant that caters to families looking for tasty pasta without breaking the bank. The company was originally founded as a division of General Mills in 1982 and is famous for its menu items and specials like unlimited breadsticks, salads, soups, and never-ending pasta bowls. Today, there are 900 Olive Gardens. The company is part of the Darden Restaurants Group that includes Yard House, LongHorn Steakhouse, and The Capital Grille.",
        "- Positive opinion score: 60%\n--- Popularity among boomers: 58%\n--- Popularity among Gen X: 55%\n--- Popularity among millennials: 63%",
        "With over 2,000 locations, Applebee's Neighborhood Grill + Bar is a fast-casual dining spot that is now ubiquitous around the world. With slogans like \"Eating good in the neighborhood,\" Applebee's solidified itself as a family dining destination with reasonable prices. The company first broke ground in 1980 in Atlanta and has been expanding ever since with American classics like sandwiches, burgers, ribs, pastas, and fried appetizers. Today, Applebee's is part of a dining group that also includes IHOP.",
        "You may also like: Copycat recipes from the most popular fast food restaurants in America",
        "- Positive opinion score: 60%\n--- Popularity among boomers: 66%\n--- Popularity among Gen X: 61%\n--- Popularity among millennials: 56%",
        "The McDonald brothers didn't just inspire the McDonald's franchise. After eating at the famed San Bernardino restaurant in the 1950s, Matthew Burns and Keith Kramer bought the rights to a grill called the Insta-Broiler and opened Insta-Burger King in 1953 in Florida. The name changed to Burger King in 1954, and explosive growth has continued since. Today, Burger King has more than 18,000 locations around the world and serves a variety of fast-food items like charbroiled burgers, fries, chicken, and even breakfast items.",
        "- Positive opinion score: 62%\n--- Popularity among boomers: 61%\n--- Popularity among Gen X: 63%\n--- Popularity among millennials: 57%",
        "Founded as the Dwarf Grill in 1946 outside Atlanta, Chick-fil-A is now a multibillion-dollar fast-food chain that specializes in chicken sandwiches. The company's founder, S. Truett Cathy, was deeply religious, and because of that, Chick-fil-A is always closed on Sundays. It has also seen its fair share of controversy. Even though there are more than 2,000 locations, Chick-fil-A is still owned and operated by the founding family, and the restaurant maintains consistency throughout by selling the same chicken sandwiches, nuggets, strips, and wraps at all its locations.",
        "- Positive opinion score: 62%\n--- Popularity among boomers: 58%\n--- Popularity among Gen X: 61%\n--- Popularity among millennials: 69%",
        "When Sonic first opened in Oklahoma in 1953, it was considered revolutionary for its ordering process. Customers could drive into a lane, order through a speaker, and never leave their cars as their food was brought out to them. The company still features carhops (aka servers on skates) and now, there are more than 3,000 establishments across the United States serving burgers, milkshakes, hot dogs, and fries. Sonic is part of a restaurant group that also includes Buffalo Wild Wings and Arby's.",
        "- Positive opinion score: 62%\n--- Popularity among boomers: 64%\n--- Popularity among Gen X: 60%\n--- Popularity among millennials: 61%",
        "When nuclear physicist Peter Buck loaned Fred DeLuca $1,000 to open a sub sandwich shop in 1965, the seeds of Subway were officially planted. The first store was located in Bridgeport, Connecticut, and franchises began popping up soon after. The official Subway name was first used in 1968; since then, the fast-food sandwich chain has grown to over 40,000 locations around the world. The restaurant itself is known for its wide-ranging menu of sub sandwiches, but also salads, wraps, and some breakfast items.",
        "- Positive opinion score: 63%\n--- Popularity among boomers: 63%\n--- Popularity among Gen X: 63%\n--- Popularity among millennials: 60%",
        "Panera Bread actually started as the St. Louis Bread Company in Missouri in 1987. When it was purchased by Au Bon Pain in 1993, the name was changed to Panera. The fast-casual, sit-down restaurant is famous for its freshly baked bread, sandwiches, and a variety of pastries, soups, and salads. Panera has more than 2,300 locations in the United States and Canada, and today it's owned by JAB Holding Company, a European group whose portfolio also includes Pret A Manger and Peet's Coffee.",
        "- Positive opinion score: 63%\n--- Popularity among boomers: 59%\n--- Popularity among Gen X: 62%\n--- Popularity among millennials: 65%",
        "Domino's Pizza used to be called DomiNick's, but the name was changed after brothers Tom and James Monoghan bought the restaurant for $500. Domino's concept was founded on delivering hot pizza to homes in a timely manner, and its meteoric success now equates to more than 17,000 restaurants in more than 90 countries. In addition to pizza, Domino's includes made-to-order salads, sides, and sandwiches on its menu.",
        "- Positive opinion score: 63%\n--- Popularity among boomers: 64%\n--- Popularity among Gen X: 59%\n--- Popularity among millennials: 62%",
        "Anyone who has ever eaten at a The Cheesecake Factory knows the menu can be overwhelming, with its endless pages of food items. But the restaurant had much humbler beginnings as a small salad and sandwich shop in Beverly Hills, California, with a variety of cheesecakes that all fit on a one-page menu. Since its start in 1978, The Cheesecake Factory has grown into a family-friendly juggernaut with more than 200 outlets around the world serving everything from soups, salads, and appetizers to pastas, sandwiches, burgers, and of course, a large variety of cheesecakes.",
        "- Positive opinion score: 64%\n--- Popularity among boomers: 62%\n--- Popularity among Gen X: 70%\n--- Popularity among millennials: 59%",
        "IHOP has been an American breakfast staple since it opened in 1958. The shortened name IHOP was coined about 15 years later and is now the official name of the company. Serving pancakes at more than 1,800 restaurants around the world, IHOP is a family-friendly enterprise known for clever branding and iconic menu items like the Rooty Tooty Fresh 'N Fruity Pancakes, Signature Pancake Sliders, and other savory dishes. It started as a breakfast-only eatery, but today, the restaurants have sandwiches, burgers, and other lunch and dinner items.",
        "- Positive opinion score: 65%\n--- Popularity among boomers: 66%\n--- Popularity among Gen X: 65%\n--- Popularity among millennials: 64%",
        "Cinnabon's mission was to create the world's greatest cinnamon roll, and with the level of success the company has achieved, it might just have accomplished that feat. The small cinnamon roll shop started in Seattle in 1985 and has grown to more than 1,200 locations around the world. Cinnabon is more bakery than a sit-down restaurant, and it serves a variety of cinnamon treats in addition to its famous rolls. Today, Cinnabon is owned by Focus Brands, which also owns Auntie Anne's, Jamba Juice, and Schlotzsky's.",
        "- Positive opinion score: 65%\n--- Popularity among boomers: 66%\n--- Popularity among Gen X: 67%\n--- Popularity among millennials: 64%",
        "Known for its iconic red roofs, Pizza Hut is a part sit-down restaurant, part carry-out spot, and part pizza delivery place. Founded in 1958 in Wichita, Kansas, as a single outlet, today, there are more than 18,000 locations around the world. Pizza Hut is also famous for its pizza innovations, trotting out items like stuffed crusts with melted cheese, a calzone-like pizza concoction called the P'zone, and the Dippin' Strips pizza, which features pieces that can be pulled off and dipped in marinara sauce.",
        "- Positive opinion score: 66%\n--- Popularity among boomers: 67%\n--- Popularity among Gen X: 63%\n--- Popularity among millennials: 65%",
        "Formerly Dunkin' Donuts, Dunkin' is a coffee and donut shop founded by Bill Rosenberg in 1950 in Quincy, Massachusetts. With the world's never-ending appetite for the round and sweet, Dunkin' has since opened more than 12,000 locations globally. While donuts are the specialty, the company's coffee also garners praise and the shops have expanded their menus to include sandwiches, wraps, and bagels.",
        "- Positive opinion score: 67%\n--- Popularity among boomers: 69%\n--- Popularity among Gen X: 68%\n--- Popularity among millennials: 65%",
        "The secret to Krispy Kreme's fluffy donuts lies in a recipe that Vernon Rudolph bought in 1937 from a New Orleans chef. Since then, the wafting scents of Krispy Kreme's addictive donuts have cascaded over cities around the world. There are now more than 1,000 Krispy Kreme donut shops that provide customers with everything from the original glazed and strawberry-filled to Oreo Cookies and Kreme and donut holes.",
        "- Positive opinion score: 69%\n--- Popularity among boomers: 71%\n--- Popularity among Gen X: 69%\n--- Popularity among millennials: 68%",
        "Named after founder Dave Thomas' daughter Melinda Lou \"Wendy\" Thomas, Wendy's was first opened in Columbus, Ohio, in 1969. Known for its square-shaped burger patties, Wendy's was one of the first of the big chains to adopt a drive-thru window. Wendy's popularity has been boosted by its creative advertising campaigns, such as its 1984 \"Where's the Beef?\" ad. Today there are more than 6,000 locations around the world serving the same square-shaped burgers, fries, baked potatoes, and Frostys.",
        "- Positive opinion score: 71%\n--- Popularity among boomers: 77%\n--- Popularity among Gen X: 75%\n--- Popularity among millennials: 63%",
        "The first Dairy Queen store opened in 1940 in Joliet, Illinois, after co-founder John Fremont McCullough developed a formula for soft-serve ice cream. McCullough opened the shop with Sherb Noble, and the brand has been expanding ever since. Known for its ice cream, Dairy Queen is also famous for sweet-treat inventions like the Peanut Buster Parfait and the Blizzard. Dairy Queen is much more than just an ice cream shop these days, as it also serves burgers, sandwiches, hot dogs, and fries. There are more than 6,800 Dairy Queen locations around the world and the uber-popular brand shows no sign of slowing down.",
        "- Positive opinion score: 74%\n--- Popularity among boomers: 79%\n--- Popularity among Gen X: 77%\n--- Popularity among millennials: 67%",
        "Burt Baskin and Irv Robbins were brothers-in-law who wanted to open an ice cream shop where families could gather to enjoy tasty treats. Though they originally opened separate stores, eventually the men merged to form Baskin-Robbins, boasting 31 flavors. Today there are more than 8,000 locations globally, and Baskin-Robbins is part of Inspire Brands, which also owns Dunkin'.",
        "\nStacker believes in making the world’s data more accessible through\nstorytelling. To that end, most Stacker stories are freely available to\nrepublish under a Creative Commons License, and we encourage you to\nshare our stories with your audience. There are a few guidelines and\nrestrictions, which you can review below.\n",
        "\nTo publish, simply grab the HTML code or text to the left and paste into\nyour CMS. In doing so, you’re agreeing to the below guidelines.\n",
        "\nStacker distribution partners receive a license to all Stacker stories,\nas well as image rights, data visualizations, forward planning tools,\nand more. If your organization is interested in becoming a Stacker\ndistribution partner, email us at\n[email protected].\n",
        "© Stacker 2024. All rights reserved."
      ]
    }
  },
  {
    "url": "https://www.gordonramsayrestaurants.com/en/us",
    "content": {
      "title": "Gordon Ramsay Restaurants North America",
      "paragraphs": [
        "Dine with us and experience unforgettable cuisine crafted by world-renowned, Michelin-starred Chef Gordon Ramsay.  ",
        "Find a Restaurant Near You",
        "Street Pizza has landed in the US and will open soon in DC. Sign up now to be the first to book.",
        "Lucky Cat by Gordon Ramsay has made its debut in South Beach’s vibrant SoFi neighborhood, now open in Miami.",
        "Join us at the newest HELL'S KITCHEN in Downtown Miami!",
        "Take a seat at our table and get a glimpse into Chef Gordon Ramsay’s culinary experiences across the globe, now open in Oklahoma City.",
        "Forget everything you thought you knew about burgers, fries and shakes.",
        "The ultimate Fish & Chips brought to you by world famous Chef Gordon Ramsay",
        "Visit world-renowned, Michelin-starred Chef Gordon Ramsay's restaurants across North America. Whether you have a taste for gourmet burgers, a Chef-Ramsay-classic beef wellington, or a new twist on a local favorite, your experience will be excellent.",
        "Join us on the Las Vegas Strip, Baltimore, Atlantic City, Southern Indiana, NYC, Naperville, D.C., OKC, Orlando, Tahoe, Kansas City, Southern California, Chicago, Miami, Vancouver, and Boston. We can't wait to serve you.",
        "",
        "Learn to cook like Michelin-starred Chef Gordon Ramsay. Online classes are available now featuring knife skills, pasta making, mastering chocolate desserts, and more. ",
        "Join the Gordon Ramsay North America E-club and be the first to learn about local events, seasonal-menu offerings, new restaurant openings, delicious recipes, and more.",
        "Share the gift of exceptional food and unforgettable memories with a gift card to dine at one of Michelin-starred Chef Gordon Ramsay restaurants. Click to view a full list of redeemable locations.",
        "Gordon Ramsay Restaurants ©Copyright 2024 Gordonramsayrestaurants.com"
      ]
    }
  },
  {
    "url": "https://www.theworlds50best.com/latinamerica/en/list/1-50",
    "content": {
      "title": "Latin America’s 50 Best Restaurants | The List and Awards",
      "paragraphs": [
        "LATAM's 50 Best Restaurants",
        "1",
        "Lima",
        "2",
        "Bogotá",
        "3",
        "Buenos Aires",
        "4",
        "São Paulo",
        "5",
        "Valle de Guadalupe",
        "6",
        "Panama City",
        "7",
        "Lima",
        "8",
        "Bogotá",
        "9",
        "Santiago",
        "10",
        "Lima",
        "11",
        "Quito",
        "12",
        "Mexico City",
        "13",
        "Lima",
        "14",
        "Rio de Janeiro",
        "15",
        "Mexico City",
        "16",
        "Cartagena",
        "17",
        "Buenos Aires",
        "18",
        "São Paulo",
        "19",
        "Ensenada",
        "20",
        "Rio de Janeiro",
        "21",
        "São Paulo",
        "22",
        "São Paulo",
        "23",
        "La Paz",
        "24",
        "Guatemala City",
        "25",
        "Panama City",
        "26",
        "Buenos Aires",
        "27",
        "Medellín",
        "28",
        "Tulum",
        "29",
        "Monterrey",
        "30",
        "Buenos Aires",
        "31",
        "Mexico City",
        "32",
        "Buenos Aires",
        "33",
        "Lima",
        "34",
        "São Paulo",
        "35",
        "Curitiba",
        "36",
        "Mexico City",
        "37",
        "Guadalajara",
        "38",
        "Buenos Aires",
        "39",
        "Moray",
        "40",
        "Cancún",
        "41",
        "Buenos Aires",
        "42",
        "Lima",
        "43",
        "Buenos Aires",
        "44",
        "Bogotá",
        "45",
        "José Ignacio",
        "46",
        "Lima",
        "47",
        "San José",
        "48",
        "Mexico City",
        "49",
        "Guatemala City",
        "50",
        "Lima",
        "51",
        "Panama City",
        "52",
        "Guatemala City",
        "53",
        "Valle de Guadalupe",
        "54",
        "Valle de Guadalupe",
        "55",
        "Mexico City",
        "56",
        "São Paulo",
        "57",
        "São Paulo",
        "58",
        "Mérida",
        "59",
        "San Salvador",
        "60",
        "Buenos Aires",
        "61",
        "Monterrey",
        "62",
        "La Paz",
        "63",
        "São Paulo",
        "64",
        "São Paulo",
        "65",
        "São Paulo",
        "66",
        "Punta del Este",
        "67",
        "Santiago",
        "68",
        "Santiago",
        "69",
        "Quito",
        "70",
        "Santiago",
        "71",
        "Montevideo",
        "72",
        "Buenos Aires",
        "73",
        "Lima",
        "74",
        "Bogotá",
        "75",
        "Lima",
        "76",
        "Salvador",
        "77",
        "Barranquilla",
        "78",
        "Montevideo",
        "79",
        "Santiago",
        "80",
        "Bogotá",
        "81",
        "Mexico City",
        "82",
        "Córdoba",
        "83",
        "Salta",
        "84",
        "La Paz",
        "85",
        "Oaxaca",
        "86",
        "Panama City",
        "87",
        "Santiago",
        "88",
        "Caracas",
        "89",
        "Medellín",
        "90",
        "José Ignacio",
        "91",
        "Santiago",
        "92",
        "Buenos Aires",
        "93",
        "Monterrey",
        "94",
        "Buenos Aires",
        "95",
        "Rio de Janeiro",
        "96",
        "Rio de Janeiro",
        "97",
        "São Paulo",
        "98",
        "Bogotá",
        "99",
        "Bogotá",
        "100",
        "Guayaquil",
        "Estrella Damm Chefs’ Choice Award 2023",
        "American Express One To Watch Award 2023",
        "Icon Award 2023",
        "Latin America’s Best Pastry Chef 2023, sponsored by República del Cacao",
        "Gin Mare Art of Hospitality Award 2023",
        "Latin America's Best Female Chef 2023",
        "Beronia Latin America's Best Sommelier 2023",
        "Flor de Caña Sustainable Restaurant Award 2023",
        "Highest New Entry Award 2023, sponsored by Aspire Lifestyles",
        "Highest Climber Award 2023, sponsored by Alaska Seafood",
        "Your inside line on the world’s leading restaurants, bars and hotels",
        "Sign up to our email newsletter"
      ]
    }
  }
]